---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentClosingEventArgs
source: html/d1baf5df-5375-db41-dbd0-c3b9d7da5b5d.htm
---
# DocumentClosingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.